app/services/remove_inactive_users_service.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def self.remove_inactive_users
    User.destroy_by(active: false)