app/services/search_movie_service.rb

  def self.search_movie(title)
    response = HTTParty.get("#{IMDB_URL}/Search/#{ENV.fetch('API_KEY', nil)}/#{ERB::Util.url_encode title}")
    movie_info = JSON.parse(response.body)

    movie = Movie.find_or_initialize_by(imdb_id: movie_info['id'], title: movie_info['title'],
                                        rating: movie_info['imDbRating'], rank: movie_info['ratings'],
                                        year: movie_info['year'])
---
SELECT "movies".* FROM "movies" WHERE "movies"."imdb_id" = $1 LIMIT $2  [["imdb_id", "tt0012349"], ["LIMIT", 1]]

  def self.search_movie_by_imdb_id(imdb_id)
    response = HTTParty.get("#{IMDB_URL}/Title/#{ENV.fetch('API_KEY', nil)}/#{imdb_id}")
    movie_info = JSON.parse(response.body)

    movie = Movie.find_or_initialize_by(imdb_id: movie_info['id'], title: movie_info['title'],
                                        rating: movie_info['imDbRating'], rank: movie_info['ratings'],
                                        year: movie_info['year'])
---
SELECT "movies".* FROM "movies" WHERE "movies"."imdb_id" = $1 AND "movies"."title" = $2 AND "movies"."rating" = $3 AND "movies"."rank" IS NULL AND "movies"."year" = $4 LIMIT $5  [["imdb_id", "tt0015324"], ["title", "Sherlock Jr."], ["rating", "8.2"], ["year", 1924], ["LIMIT", 1]]