app/controllers/movie_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:id])

SELECT COUNT(*) FROM "movies"
---
  def index
    @movies = Movie.page(params[:page]).per(3)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT $2  [["title", "aaa"], ["LIMIT", 1]]
---
  def search
    movie = Movie.find_by(title: params[:title])