app/controllers/movie_controller.rb

INSERT INTO "movies" ("imdb_id", "title", "rating", "rank", "year", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    movie = Movie.new(movie_parameters)
    movie.save

SELECT "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    @movies = Movie.page(params[:page]).per(3)