app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    begin
      @user = User.create!(user_params)